#+FILETAGS: Inbox
#+STARTUP: content
** DONE SLD sensor model summary
   CLOSED: [2020-07-02 Thu 18:49]
   :PROPERTIES:
   :ID:       5876BFF9-635A-4FC5-ACB6-ED8B1801633A
   :END:
   :LOGBOOK:
   CLOCK: [2020-03-13 Fri 22:16]--[2020-07-02 Thu 17:38] => 2659:22
   :END:
 [2020-03-13 Fri 22:16]
 According to GK's instruments and my plan, make a survey about the existing SLD sensor of the *shape*, *principle*, *evaluation*, and *improvement* for our sensor.

**** tangent

#+CAPTION: ratio
| radius1 | radius2 |         inner ratio |     external ratio |
|     3.0 |     5.5 | 0.35294117647058826 | 2.8333333333333335 |
|     5.5 |     7.0 |                0.44 |  2.272727272727273 |
|     7.0 |    10.0 |  0.4117647058823529 | 2.4285714285714284 |
|    10.0 |     3.0 |  0.7692307692307693 |                1.3 |
#+TBLFM: @2$3..@5$3='(/ $1 (+ $1 $2));N::@2$4..@5$4='(/ (+ $1 $2) $1);N

** DONE Experimental Data Process
   CLOSED: [2020-07-02 Thu 18:49]
   :LOGBOOK:
   CLOCK: [2020-04-04 Sat 15:19]--[2020-04-04 Sat 16:49] =>  1:30
   :END:
 [2020-04-04 Sat 15:19]

* TODO PCIe and NVMe
  SCHEDULED: <2020-07-18 Sat 9:00>
  :LOGBOOK:
  CLOCK: [2020-07-02 Thu 21:43]--[2020-07-02 Thu 22:17] =>  0:34
  :END:
[2020-07-02 Thu 21:43]

** DONE FPGA Book: FPGA芯片结构与设计实现
   CLOSED: [2020-07-15 Wed 09:18]
   未读完，选择性参阅。
   :LOGBOOK:
   CLOCK: [2020-07-06 Mon 10:34]--[2020-07-06 Mon 10:35] =>  0:01
   CLOCK: [2020-07-05 Sun 21:49]--[2020-07-05 Sun 21:51] =>  0:02
   :END:
 [2020-07-05 Sun 21:49]
**** 逻辑单元
     :LOGBOOK:
     CLOCK: [2020-07-06 Mon 09:26]--[2020-07-06 Mon 10:34] =>  1:08
     :END:
 基于查找表(Look Up Table, LUT)的可编程逻辑单元主要由以下几部分组成:
 两个四输入的LUT，两个进位逻辑，两个可编程触发器DFF，还包含64个配置用的SRAM、信号产生模块以及控制逻辑等。每个可编程逻辑单元中还包含一个与门资源，用来实现有效的乘法运算。可实现组合逻辑电路和时序逻辑电路。
*** 时钟
    :LOGBOOK:
    CLOCK: [2020-07-05 Sun 21:51]--[2020-07-05 Sun 22:04] =>  0:13
    :END:
    时钟网络是时钟源和寄存器时钟端之间的一系列组合逻辑和金属连线组成的网格结构，设计优劣在一定程度上决定这FPGA系统整体的速度、功耗和面积。

    - 树形时钟网络：输出端都是独立分支
    - 网格时钟网络：输出端通过纵横金属网格连接起来

*** 电源
    :LOGBOOK:
    CLOCK: [2020-07-05 Sun 22:04]--[2020-07-05 Sun 22:15] =>  0:11
    :END:
    电源/地线网络分析和漏电优化技术（电源完整性）
